---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalNodeData
source: html/63b79535-a76a-a687-1dd5-6556da068369.htm
---
# AnalyticalNodeData Members

Releases all resources used by the AnalyticalNodeData